const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});
// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
//10 + 5 เท่ากับ 3
test('10 + 5 เท่ากับ 15', ()=> {
  expect(sum(10,5)).toBe(15);
});
//20 + 5 เท่ากับ 3
test('20 + 5 เท่ากับ 25', ()=> {
  expect(sum(20,5)).toBe(25);
});
//29 + 1 เท่ากับ 30
test('29 + 1 เท่ากับ 30', ()=> {
  expect(sum(1,2)).toBe(3);
});